app/Controllers/Cursos.php

public function index($activo = '1')
{
    $cursos = $this->cursos->where('activo',$activo)->findAll();
    $usuarios = $this->usuarios->where('activo',$activo)->findAll();
    $modalidades = $this->modalidades->where('activo',$activo)->findAll();
---
SELECT *
FROM "registro"."cursos"
WHERE "activo" = '1'
SELECT *
FROM "registro"."usuarios"
WHERE "activo" = '1'
SELECT *
FROM "registro"."modalidad"
WHERE "activo" = '1'

public function nuevo()
{
    $usuarios = $this->usuarios->where('activo', '1')->findAll();
---
SELECT *
FROM "registro"."usuarios"
WHERE "activo" = '1'

public function editar($id_cursos)
{
    $periodos = $this->periodos->where('activo', '1')->findAll();
    $usuarios = $this->usuarios->where('activo', '1')->findAll();
    $modalidades = $this->modalidades->where('activo', '1')->findAll();
    $tiposAct = $this->tiposAct->where('activo', '1')->findAll();
    $curso = $this->cursos->where('id_cursos',$id_cursos)->first();
---
SELECT *
FROM "registro"."periodos"
WHERE "activo" = '1'
SELECT *
FROM "registro"."usuarios"
WHERE "activo" = '1'
SELECT *
FROM "registro"."modalidad"
WHERE "activo" = '1'
SELECT *
FROM "registro"."cursos"
WHERE "id_cursos" = '31'
 LIMIT 1