app/Controllers/Oferta_Cursos.php

public function index($activo = '1')
{
    $oferta_cursos = $this->cursos->getOferta_CursosOrdenados('nom_curso', $activo)->findAll();
---
SELECT *
FROM "registro"."cursos"
WHERE "activo" = '1'
ORDER BY "nom_curso" ASC