app/Controllers/Prof_cursos.php

public function index($activo = '1')
{
    $prof_cursos = $this->usuarios->where('activo', $activo)->findAll();
---
SELECT *
FROM "registro"."usuarios"
WHERE "activo" = '1'

public function nuevo($activo = '1')
{
    $roles = $this->roles->where('activo', '1')->findAll();
---
SELECT *
FROM "registro"."roles"
WHERE "activo" = '1'

public function insertar()
{
    if ($this->request->getMethod() == "post" && $this->validate($this->reglas)) {

        $hash = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);

        $this->usuarios->save([
            'usuario' => $this->request->getPost('usuario'),
            'password' => $hash,
            'nombre' => $this->request->getPost('nombre'),
            'ap_paterno' => $this->request->getPost('ap_paterno'),
            'ap_materno' => $this->request->getPost('ap_materno'),
            'email' => $this->request->getPost('correo'),
            'cat_rol' => $this->request->getPost('cat_rol')]);
---
INSERT INTO "registro"."usuarios" ("usuario", "password", "nombre", "ap_paterno", "ap_materno", "email", "cat_rol") VALUES ('Ejemplo1', '$2y$10$uc82l0Uw.QRUl3uhvWgpDe0HSeku5vz3c2gAP/Ue2h0dE0zuNd8va', 'Ejemplo1', 'Ejemplo1', 'Ejemplo1', 'ejemplo@ejemplo.com', '3')