app/Controllers/Usuarios.php

    public function nuevo()
    {
        $dependencias = $this->dependencias->where('activo', '1')->findAll();
        $carreras = $this->carreras->where('activo', '1')->findAll();
        $categorias = $this->categorias->where('activo', '1')->findAll();
        $generos = $this->generos->where('activo', '1')->findAll();
        $cursos = $this->cursos->where('activo', '1')->findAll();
        $roles = $this->roles->where('activo', '1')->findAll();
---
SELECT *
FROM "registro"."dependencia"
WHERE "activo" = '1'
SELECT *
FROM "registro"."carrera"
WHERE "activo" = '1'
SELECT *
FROM "registro"."categoria"
WHERE "activo" = '1'
SELECT *
FROM "registro"."genero"
WHERE "activo" = '1'
SELECT *
FROM "registro"."cursos"
WHERE "activo" = '1'
SELECT *
FROM "registro"."roles"
WHERE "activo" = '1'

    public function buscar()
    {

        $generos = $this->generos->where('activo', '1')->findAll();
        $categorias = $this->categorias->where('activo', '1')->findAll();
        $carreras = $this->carreras->where('activo', '1')->findAll();
        $dependencias = $this->dependencias->where('activo', '1')->findAll();
        $cursos = $this->cursos->where('activo', '1')->findAll();
---
SELECT *
FROM "registro"."genero"
WHERE "activo" = '1'
SELECT *
FROM "registro"."categoria"
WHERE "activo" = '1'
SELECT *
FROM "registro"."carrera"
WHERE "activo" = '1'
SELECT *
FROM "registro"."dependencia"
WHERE "activo" = '1'
SELECT *
FROM "registro"."cursos"
WHERE "activo" = '1'

    public function valida(){
        if ($this->request->getMethod() == "post" && $this->validate($this->reglasLogin)) {
            $usuario = $this->request->getPost('usuario');
            $password = $this->request->getPost('password');
            $datosUsuario = $this->usuarios->where('usuario', $usuario)->first();
---
SELECT *
FROM "registro"."usuarios"
WHERE "usuario" = 'SARL831115'
 LIMIT 1