app/Controllers/Usuarios.php

    public function nuevo()
    {
        $dependencias = $this->dependencias->where('activo', '1')->findAll();
        $carreras = $this->carreras->where('activo', '1')->findAll();
        $categorias = $this->categorias->where('activo', '1')->findAll();
        $generos = $this->generos->where('activo', '1')->findAll();
        $cursos = $this->cursos->where('activo', '1')->findAll();
        $roles = $this->roles->where('activo', '1')->findAll();
---
SELECT *
FROM "registro"."roles"
WHERE "activo" = '1'